[
  {
    "title": "The Utilization of Block-chain Innovation to Confirm KYC Records",
    "authors": [
      "Yogesh Mali",
      "Sweta Dargad",
      "Asheesh Dixit",
      "Nalini Tiwari",
      "Sneha Narkhede",
      "Ashvini Chaudhari"
    ],
    "venue": "International Carnahan Conference on Security…",
    "pub_date": "11 October 2023",
    "tldr": "TLDR\nThis application allows users to manage their own identities through block-chain self-management and secure their data on the block-chain by replacing servers, ensuring the immutability and integrity of their information.\nExpand",
    "pdf_link": "N/A"
  },
  {
    "title": "Securing Financial Systems with Block chain: A Comprehensive Review of Block chainand Cybersecurity Practices",
    "authors": [
      "Noman Abid"
    ],
    "venue": "N/A",
    "pub_date": "1 October 2024",
    "tldr": "TLDR\nAs best practices are implemented and the threats advance, the financial institutions will be better placed to realize the full value of block chain technology while at the same time protecting the privacy and security of people’s financial transactions.\nExpand",
    "pdf_link": "N/A"
  },
  {
    "title": "Role of Block-Chain in Health-Care Application",
    "authors": [
      "Yogesh Mali",
      "Bhagyashri Vyas",
      "Vishal Borate",
      "Pournima Sutar",
      "Mrunal Jagtap",
      "Jayashree Palkar"
    ],
    "venue": "2023 IEEE International Conference on Blockchain…",
    "pub_date": "6 October 2023",
    "tldr": "TLDR\nThe suggested strategy can deal with a lot of medical services information while holding more noteworthy exchange speeds and further developed effectiveness, which recommends that it can possibly expand the versatility of blockchain-based wellbeing applications.\nExpand",
    "pdf_link": "N/A"
  },
  {
    "title": "Improved services traceability and management of a food value chain using block-chain network: a case of Nigeria",
    "authors": [
      "Maureen Ifeanyi Akazue",
      "Rume Elizabeth Yoro",
      "Bridget Ogheneovo Malasowe",
      "Obinna Nwankwo",
      "Arnold Arnold Ojugo"
    ],
    "venue": "Indonesian Journal of Electrical Engineering and…",
    "pub_date": "1 March 2023",
    "tldr": "N/A",
    "pdf_link": "N/A"
  },
  {
    "title": "Exploring the Role of Block-chain Technology in Strengthening International Legal Guarantees for Investment Activity",
    "authors": [
      "Naeem Allah Rakha"
    ],
    "venue": "International journal of law and policy",
    "pub_date": "2 April 2023",
    "tldr": "N/A",
    "pdf_link": "N/A"
  },
  {
    "title": "Smart-City Ecosystem Using Block-Chain Technology",
    "authors": [
      "Shokhrukh Davlyatov"
    ],
    "venue": "2023 3rd International Conference on Advance…",
    "pub_date": "12 May 2023",
    "tldr": "TLDR\nA Smart-city ecosystem model is suggested, which is founded on smart contracts established between firms, inhabitants, and government agencies, and it provides a synopsis of the potential application domains of the technology.\nExpand",
    "pdf_link": "N/A"
  },
  {
    "title": "Design and Implementation of Block Chain with Cybersecurity Scheme for Fog Based Internet of Things",
    "authors": [
      "Vamsi Krishna Chidipothu",
      "Lakshman kumar Kanulla",
      "Chaitanya Kiran Pandey",
      "Sandeep Kumar Davuluri",
      "M. Tiwari",
      "Devesh Pratap Singh"
    ],
    "venue": "International Conferences on Contemporary…",
    "pub_date": "14 September 2023",
    "tldr": "TLDR\nA protected Block chain-based conspire is given in this paper to guarantee the veracity of hubs and information and the security of information transmission in the mist climate.\nExpand",
    "pdf_link": "N/A"
  },
  {
    "title": "A Decentralized Digital Voting System Based on Block chain Architecture",
    "authors": [
      "Shambhavi Bhardwaj",
      "T. Poongodi",
      "Ashutosh Dixit",
      "S. Sharma"
    ],
    "venue": "2022 2nd International Conference on Innovative…",
    "pub_date": "23 February 2022",
    "tldr": "TLDR\nThis Block chain enabled election is the need of the hour, People can cast votes from their own space just with the help of a mobile phone or a computer, Security would get enhanced and threats like EVM hacking, Chaos at election booth would reduce drastically just by the implementation of this advanced voting system.\nExpand",
    "pdf_link": "N/A"
  },
  {
    "title": "The role of block chain technology in circular economy practices to improve organisational performance",
    "authors": [
      "Syed Abdul Rehman Khan",
      "Zhang Yu",
      "Salman Sarwat",
      "D. Godil",
      "Sumeela Amin",
      "Sobia Shujaat"
    ],
    "venue": "International Journal of Logistics Research and…",
    "pub_date": "11 January 2021",
    "tldr": "TLDR\nThe role of blockchain technology for the circular economy to enhance organisational performance in the context of China–Pakistan-Economic-Corridor (CPEC) is examined.\nExpand",
    "pdf_link": "N/A"
  },
  {
    "title": "Block Chain Application in Insurance Services: A Systematic Review of the Evidence",
    "authors": [
      "A. Shetty",
      "Adithya D. Shetty",
      "Komal Jenifer Dsouza"
    ],
    "venue": "SAGE Open",
    "pub_date": "1 January 2022",
    "tldr": "TLDR\nIt is disclosed that blockchain, as a single source of reality, has the potential to improve productivity and mitigate the complexity of the insurance processes and the challenges and obstacles in the application of Blockchain technology in the Insurance Sector.\nExpand",
    "pdf_link": "N/A"
  }
]