[
  {
    "title": "PyTorch: An Imperative Style, High-Performance Deep Learning Library",
    "authors": [
      "Adam Paszke",
      "Sam Gross",
      "Soumith Chintala"
    ],
    "venue": "Neural Information Processing Systems",
    "pub_date": "3 December 2019",
    "tldr": "TLDR\nThis paper details the principles that drove the implementation of PyTorch and how they are reflected in its architecture, and explains how the careful and pragmatic implementation of the key components of its runtime enables them to work together to achieve compelling performance.\nExpand",
    "pdf_link": "https://arxiv.org/pdf/1912.01703.pdf"
  },
  {
    "title": "Photorealistic Text-to-Image Diffusion Models with Deep Language Understanding",
    "authors": [
      "Chitwan Saharia",
      "William Chan",
      "Mohammad Norouzi"
    ],
    "venue": "Neural Information Processing Systems",
    "pub_date": "23 May 2022",
    "tldr": "TLDR\nThis work presents Imagen, a text-to-image diffusion model with an unprecedented degree of photorealism and a deep level of language understanding, and finds that human raters prefer Imagen over other models in side-by-side comparisons, both in terms of sample quality and image-text alignment.\nExpand",
    "pdf_link": "https://arxiv.org/pdf/2205.11487.pdf"
  },
  {
    "title": "Mastering the game of Go with deep neural networks and tree search",
    "authors": [
      "David Silver",
      "Aja Huang",
      "D. Hassabis"
    ],
    "venue": "Nature",
    "pub_date": "27 January 2016",
    "tldr": "TLDR\nUsing this search algorithm, the program AlphaGo achieved a 99.8% winning rate against other Go programs, and defeated the human European Go champion by 5 games to 0.5, the first time that a computer program has defeated a human professional player in the full-sized game of Go.\nExpand",
    "pdf_link": "N/A"
  },
  {
    "title": "Temporal Segment Networks: Towards Good Practices for Deep Action Recognition",
    "authors": [
      "Limin Wang",
      "Yuanjun Xiong",
      "L. Gool"
    ],
    "venue": "European Conference on Computer Vision",
    "pub_date": "2 August 2016",
    "tldr": "N/A",
    "pdf_link": "https://arxiv.org/pdf/1608.00859.pdf"
  },
  {
    "title": "Deep learning for time series classification: a review",
    "authors": [
      "Hassan Ismail Fawaz",
      "G. Forestier",
      "J. Weber",
      "L. Idoumghar",
      "Pierre-Alain Muller"
    ],
    "venue": "Data mining and knowledge discovery",
    "pub_date": "12 September 2018",
    "tldr": "TLDR\nThis article proposes the most exhaustive study of DNNs for TSC by training 8730 deep learning models on 97 time series datasets and provides an open source deep learning framework to the TSC community.\nExpand",
    "pdf_link": "N/A"
  },
  {
    "title": "Development and Validation of a Deep Learning Algorithm for Detection of Diabetic Retinopathy in Retinal Fundus Photographs.",
    "authors": [
      "Varun Gulshan",
      "L. Peng",
      "D. Webster"
    ],
    "venue": "Journal of the American Medical Association (JAMA…",
    "pub_date": "13 December 2016",
    "tldr": "TLDR\nAn algorithm based on deep machine learning had high sensitivity and specificity for detecting referable diabetic retinopathy and diabetic macular edema in retinal fundus photographs from adults with diabetes.\nExpand",
    "pdf_link": "N/A"
  },
  {
    "title": "Broad Learning System: An Effective and Efficient Incremental Learning System Without the Need for Deep Architecture",
    "authors": [
      "C. L. P. Chen",
      "Zhulin Liu"
    ],
    "venue": "IEEE Transactions on Neural Networks and Learning…",
    "pub_date": "2018",
    "tldr": "TLDR\nCompared with existing deep neural networks, experimental results on the Modified National Institute of Standards and Technology database and NYU NORB object recognition dataset benchmark data demonstrate the effectiveness of the proposed Broad Learning System.\nExpand",
    "pdf_link": "N/A"
  },
  {
    "title": "Deep Graph Infomax",
    "authors": [
      "Petar Velickovic",
      "W. Fedus",
      "William L. Hamilton",
      "P. Lio’",
      "Yoshua Bengio",
      "R. Devon Hjelm"
    ],
    "venue": "International Conference on Learning…",
    "pub_date": "27 September 2018",
    "tldr": "TLDR\nDeep Graph Infomax (DGI) is presented, a general approach for learning node representations within graph-structured data in an unsupervised manner that is readily applicable to both transductive and inductive learning setups.\nExpand",
    "pdf_link": "https://arxiv.org/pdf/1809.10341.pdf"
  },
  {
    "title": "Microbial diversity in the deep sea and the underexplored “rare biosphere”",
    "authors": [
      "M. Sogin",
      "H. Morrison",
      "G. Herndl"
    ],
    "venue": "Proceedings of the National Academy of Sciences…",
    "pub_date": "8 August 2006",
    "tldr": "TLDR\nIt is shown that bacterial communities of deep water masses of the North Atlantic and diffuse flow hydrothermal vents are one to two orders of magnitude more complex than previously reported for any microbial environment.\nExpand",
    "pdf_link": "N/A"
  },
  {
    "title": "Robust deep learning based protein sequence design using ProteinMPNN",
    "authors": [
      "J. Dauparas",
      "I. Anishchenko",
      "D. Baker"
    ],
    "venue": "bioRxiv",
    "pub_date": "4 June 2022",
    "tldr": "TLDR\nThe broad utility and high accuracy of ProteinMPNN is demonstrated using X-ray crystallography, cryoEM and functional studies by rescuing previously failed designs, made using Rosetta or AlphaFold, of protein monomers, cyclic homo-oligomers, tetrahedral nanoparticles, and target binding proteins.\nExpand",
    "pdf_link": "N/A"
  }
]